type Advantage = {
  title: string;
  description: string;
};

type Business = {
  role: 'Інвестору' | 'Партнеру' | 'Локаціям';
  icon: string;
  buttonLabel: string;
  presentationBtn: string;
  helpText: string;
  advantages: Advantage[];
};

export const business: Business[] = [
  {
    role: 'Інвестору',
    icon: 'money',
    buttonLabel: 'Інвестувати',
    presentationBtn: 'Презентація інвесторам',
    helpText:
      'Ми завжди раді надати консультацію нашим майбутнім інвесторам і відповісти на всі Ваші питання!',
    advantages: [
      {
        title: 'Малий поріг входу',
        description:
          'Франшиза від 650 000 грн. Ви стає власником автоматичного комплексу. Розміщенням та обслуговуванням займається наша компанія.',
      },
      {
        title: 'Окупність за 1 рік',
        description:
          'За рахунок того, що в ХАБі представлені цілий комплекс товарів та послуг, Ви отримуєте швидку окупність та високій дохід.',
      },
      {
        title: 'Гарантоване повернення вкладень протягом 2х років',
        description:
          'Компанія гарантує 100% повернення інвестицій при будь-яких обставинах.',
      },
    ],
  },
  {
    role: 'Партнеру',
    icon: 'partner',
    buttonLabel: 'Стати партнером',
    presentationBtn: 'Презентація партнерам',
    helpText:
      'Ми завжди раді надати консультацію нашим майбутнім партнерам і відповісти на всі Ваші питання!',
    advantages: [
      {
        title: 'Розширення та масштабування',
        description: 'Присутність у топових локаціях із високим трафіком.',
      },
      {
        title: 'Значна економія',
        description: 'Мінімізовані витрати на утримання торгової точки.',
      },
      {
        title: 'Ефективна реклама',
        description:
          'Отримуєте масовану рекламну компанію та просування вашого бренду.',
      },
      {
        title: 'Зручна логістика',
        description:
          'Партнер звільнений від логістичного навантаження та операційної діяльності. ',
      },
    ],
  },
  {
    role: 'Локаціям',
    icon: 'location',
    presentationBtn: 'Презентація локаціям',
    buttonLabel: 'Пропоную місце',
    helpText:
      'Ми завжди раді надати консультацію власникам наших майбутніх локацій і відповісти на всі Ваші питання!',
    advantages: [
      {
        title: 'Цілий комплекс послуг',
        description:
          'Гості вашої локації на справді отримують величезне задоволення від отриманих товарів та послуг в одному місці.',
      },
      {
        title: 'Безпечне зберігання речей',
        description:
          'Безкоштовна модернізація послуг зберігання речей. Тепер на вашій локації працює безпечна та сучасна автоматична камера зберігання.',
      },
      {
        title: 'Інновації та ваш імідж',
        description:
          'Збільшення потоку гостей за рахунок задоволення потреб багатьох людей.',
      },
      {
        title: 'Магніт до вашої локації',
        description:
          'Інноваційна система на Вашій території збільшить пізнаванність та підвищить імідж.',
      },
    ],
  },
];
