type Information = {
  number: string;
  title: string;
  description: string;
  price: string;
  duration: string;
};

export const information: Information[] = [
  {
    number: '1',
    title: 'Хімчистка та ремонт одягу',
    description:
      'Тут ми помістимо опис послуги, або конкретне технічне рішення.Все що завгодно що ви хочете сказати клієнту щодо послуги.               Все що завгодно що ви хочете сказати клієнту щодо послуги.',
    price: '$1 400+',
    duration: '7+ днів',
  },
  {
    number: '2',
    title: 'Роздрібна торгівля та авторські  композиції',
    description:
      'Тут ми помістимо опис послуги, або конкретне технічне рішення.Все що завгодно що ви хочете сказати клієнту щодо послуги.               Все що завгодно що ви хочете сказати клієнту щодо послуги.',
    price: '$1 400+',
    duration: '14+ днів',
  },
  {
    number: '3',
    title: 'Логістика: прийом, зберігання,  передача',
    description:
      'Тут ми помістимо опис послуги, або конкретне технічне рішення.Все що завгодно що ви хочете сказати клієнту щодо послуги.               Все що завгодно що ви хочете сказати клієнту щодо послуги.',
    price: '$1 400 000+',
    duration: '14+ днів',
  },
  {
    number: '4',
    title: 'Прокат техніки та інструментів',
    description:
      'Тут ми помістимо опис послуги, або конкретне технічне рішення.Все що завгодно що ви хочете сказати клієнту щодо послуги.               Все що завгодно що ви хочете сказати клієнту щодо послуги.',
    price: '$1 400+',
    duration: '114+ днів',
  },
  {
    number: '5',
    title: 'Швидкі побутові послуги',
    description:
      'Тут ми помістимо опис послуги, або конкретне технічне рішення.Все що завгодно що ви хочете сказати клієнту щодо послуги.               Все що завгодно що ви хочете сказати клієнту щодо послуги.',
    price: '$1 400+',
    duration: '14+ днів',
  },
];
